//2. Напиши код, который выводит имя пользователя в alert().
let userName = "Куралай";
alert("Добро пожаловать, " + userName + "!");

/* 3. Создай переменные product, price, quantity и выведи общую стоимость. */
let product = "Мандарины";
let price = "2500";
let quantity = 2;
let total = price * quantity;
console.log("Общая стоимость мандаринов: " + total);

//4. Используй оператор сравнения для проверки, больше ли цена 1000.
console.log(total > 1000);

//5. Добавь в код комментарии (// и /* */).

/* 6. Создай выражение с приоритетом операторов и объясни порядок вычисления. */
let result = (8 + 2) * 5; //скобки->умножение->присвоение
console.log("Результат: " + result);

//7. Исправь ошибку в коде с пропущенными кавычками или неправильным регистром.
let userSurname = "Ахметова";
//console.log("Фамилия: " + usersurname);//Ошибка
console.log("Фамилия: " + userSurname); //8. Реализуй вывод результата в консоль (console.log()).
