//2. Сделай функцию sum(a, b) и выведи результат. Добавь return и используй результат в alert().

//Эта функция sum(a, b) принимает два аргумента a и b, которые могут быть любыми числами.
function sum(a, b) {
  return a + b; //Она складывает эти два числа и возвращает результат.
}
alert(
  "Сумма: " + sum(2, 4)
); /*Когда функция вызывается, например, sum(2, 4), она возвращает 6. 
Затем, результат 6 передается в функцию alert() 
с помощью оператора +, чтобы отобразить его в окне диалога.*/

//В итоге, в окне диалога будет отображено сообщение "Сумма: 6".
